"""
Задача 32: Определить индексы элементов массива (списка),
значения которых принадлежат заданному диапазону (т.е. не
меньше заданного минимума и не больше заданного
максимума)

Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
Вывод: [1, 9, 13, 14, 19]
"""

from random import randint

my_list = [randint(-10, 20) for i in range(20)]
print(my_list)
min_el = int(input('Введите мин элемент диапазона: '))
max_el = int(input('Введите макс элемент диапазона: '))
res = []
for i in range(len(my_list)):
    if min_el <= my_list[i] <= max_el:
        res.append(i)
print(res)
